abraham120/erika2/pkg/mcu/st_stm32_stm32f4xx/src/startup_stm32f4xx_gnu.S
/**
  ******************************************************************************
  * @file      startup_stm32f4xx.s
  * @author    MCD Application Team
  * @version   V1.0.0
  * @date      30-September-2011
  * @brief     STM32F4xx Devices vector table for Atollic TrueSTUDIO toolchain. 
  *            This module performs:
  *                - Set the initial SP
  *                - Set the initial PC == EE_cortex_mx_default_reset_ISR,
  *                - Set the vector table entries with the exceptions ISR address
  *                - Configure the clock system and the external SRAM mounted on 
  *                  STM324xG-EVAL board to be used as data memory (optional, 
  *                  to be enabled by user)
  *                - Branches to main in the C library (which eventually
  *                  calls main()).
  *            After Reset the Cortex-M4 processor is in Thread mode,
  *            priority is Privileged, and the Stack is set to Main.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */
    
#include "eecfg.h"	/* Configurable by RT-Druid */
	
	.syntax unified
	.cpu cortex-m4
	.arch armv7e-m
 // .fpu softvfp

    .section .stack
    .align 3
#ifdef __STACK_SIZE
    .equ    Stack_Size, __STACK_SIZE
#else
    .equ    Stack_Size, 0xc00
#endif
    .globl    __StackTop
    .globl    __StackLimit
__StackLimit:
    .space    Stack_Size
    .size __StackLimit, . - __StackLimit
__StackTop:
    .size __StackTop, . - __StackTop

    .section .heap
    .align 3
#ifdef __HEAP_SIZE
    .equ    Heap_Size, __HEAP_SIZE
#else
    .equ    Heap_Size, 0x100
#endif
    .globl    __HeapBase
    .globl    __HeapLimit
__HeapBase:
    .if    Heap_Size
    .space    Heap_Size
    .endif
    .size __HeapBase, . - __HeapBase
__HeapLimit:
    .size __HeapLimit, . - __HeapLimit

/**
 * @brief  This is the code that gets called when the processor first
 *          starts execution following a reset event. Only the absolutely
 *          necessary set is performed, after which the application
 *          supplied main() routine is called. 
 * @param  None
 * @retval : None
*/

	.section  .text.EE_cortex_mx_default_reset_ISR
    .thumb
    .thumb_func
    .align 2	
	.weak  EE_cortex_mx_default_reset_ISR
	.global  EE_cortex_mx_default_ISR
	.type  EE_cortex_mx_default_reset_ISR, %function
EE_cortex_mx_default_reset_ISR:  
/* Copy the data segment initializers from flash to SRAM */  
  movs  r1, #0
  b  LoopCopyDataInit

CopyDataInit:
  ldr  r3, =__etext
  ldr  r3, [r3, r1]
  str  r3, [r0, r1]
  adds  r1, r1, #4
    
LoopCopyDataInit:
  ldr  r0, =__data_start__
  ldr  r3, =__data_end__
  adds  r2, r0, r1
  cmp  r2, r3
  bcc  CopyDataInit
  ldr  r2, =__bss_start__
  b  LoopFillZerobss
/* Zero fill the bss segment. */  
FillZerobss:
  movs  r3, #0
  str  r3, [r2], #4
    
LoopFillZerobss:
  ldr  r3, = __bss_end__
  cmp  r2, r3
  bcc  FillZerobss

/* Call the clock system intitialization function.*/
/*#ifndef __NO_SYSTEM_INIT
    bl    SystemInit
#endif*/
  
/* Call static constructors */
    /******* bl __libc_init_array ******/

/* Call the application's entry point.*/
	bl  main
	bx  lr  
	.pool
	.size  EE_cortex_mx_default_reset_ISR, .-EE_cortex_mx_default_reset_ISR

/**
 * @brief  This is the code that gets called when the processor receives an 
 *         unexpected interrupt.  This simply enters an infinite loop, preserving
 *         the system state for examination by a debugger.
 * @param  None     
 * @retval None       
*/
    .section  .text.EE_cortex_mx_default_ISR,"ax",%progbits
	.align 1
	.thumb_func
	.type EE_cortex_mx_default_ISR, %function
	
EE_cortex_mx_default_ISR:
#ifdef	DEBUG
	bkpt	#0x00
#endif	/* DEBUG */
Infinite_Loop:
	b  Infinite_Loop
	.size  EE_cortex_mx_default_ISR, .-EE_cortex_mx_default_ISR


/******************************************************************************
*																			
* This is the code that gets called when the processor receives a BUS FAULT 
* exception.
*
*******************************************************************************/
#ifdef	__AUTOSAR_R4_0__
	.section  .text.EE_cortex_mx_as_bus_fault_ISR,"ax",%progbits
	.align 1
	.thumb_func
	.type EE_cortex_mx_as_bus_fault_ISR, %function
EE_cortex_mx_as_bus_fault_ISR:
#ifdef	DEBUG
	bkpt	#0x00
#endif	/* DEBUG */
	b	EE_cortex_mx_as_bus_fault_ISR
	.size  EE_cortex_mx_as_bus_fault_ISR, .-EE_cortex_mx_as_bus_fault_ISR
#endif	/* __AUTOSAR_R4_0__ */

/******************************************************************************
*
* This is the code that gets called when the processor receives a HARD FAULT
* exception.
*
*******************************************************************************/
#ifdef	__AUTOSAR_R4_0__
	.section  .text.EE_cortex_mx_as_hard_fault_ISR,"ax",%progbits
	.align 1
	.thumb_func
	.type EE_cortex_mx_as_hard_fault_ISR, %function	
EE_cortex_mx_as_hard_fault_ISR:
#ifdef	DEBUG
	bkpt	#0x00
#endif	/* DEBUG */
	b	EE_cortex_mx_as_hard_fault_ISR
	.size  EE_cortex_mx_as_hard_fault_ISR, .-EE_cortex_mx_as_hard_fault_ISR
#endif	/* __AUTOSAR_R4_0__ */

/******************************************************************************
*
* This is the code used to provide _exit
*
*******************************************************************************/
	.section  .text._exit,"ax",%progbits
	.align 1
	.thumb_func
	.weak _exit
	.type _exit, %function	
_exit:
#ifdef	DEBUG
	bkpt	#0x00
#endif	/* DEBUG */
	b	_exit
	.size  _exit, .-_exit

