abraham120/erika2/pkg/mcu/st_stm32_stm32f4xx/src/startup_stm32f4xx_gnu.S
/******************************************************************************
*
* The minimal vector table for a Cortex M3. Note that the proper constructs
* must be placed on this to ensure that it ends up at physical address
* 0x0000.0000.
* 
*******************************************************************************/
	.section  .isr_vector,"a",%progbits
	.align 2
	.type  __isr_vector, %object
	.global  __isr_vector
    
__isr_vector:
	.word  __StackTop
	.word  EE_cortex_mx_default_reset_ISR
	.word  EE_CORTEX_MX_NMI_ISR
	.word  EE_CORTEX_MX_HARD_FAULT_ISR
	.word  EE_CORTEX_MX_MPU_FAULT_ISR
	.word  EE_CORTEX_MX_BUS_FAULT_ISR
	.word  EE_CORTEX_MX_USAGE_FAULT_ISR
	.word  0
	.word  0
	.word  0
	.word  0
	.word  EE_cortex_mx_svc_ISR
	.word  EE_CORTEX_MX_DEBUG_MONITOR_ISR
	.word  0
	.word  EE_cortex_mx_pendsv_ISR
	.word  EE_CORTEX_MX_SYSTICK_ISR

	/* External Interrupts */
	.word     EE_CORTEX_MX_WWDG_ISR               /* Window WatchDog              */                                        
	.word     EE_CORTEX_MX_PVD_ISR                /* PVD through EXTI Line detection */                        
	.word     EE_CORTEX_MX_TAMP_STAMP_ISR         /* Tamper and TimeStamps through the EXTI line */            
	.word     EE_CORTEX_MX_RTC_WKUP_ISR           /* RTC Wakeup through the EXTI line */                      
	.word     EE_CORTEX_MX_FLASH_ISR              /* FLASH                        */                                          
	.word     EE_CORTEX_MX_RCC_ISR                /* RCC                          */                                            
	.word     EE_CORTEX_MX_EXTI0_ISR              /* EXTI Line0                   */                        
	.word     EE_CORTEX_MX_EXTI1_ISR              /* EXTI Line1                   */                          
	.word     EE_CORTEX_MX_EXTI2_ISR              /* EXTI Line2                   */                          
	.word     EE_CORTEX_MX_EXTI3_ISR              /* EXTI Line3                   */                          
	.word     EE_CORTEX_MX_EXTI4_ISR              /* EXTI Line4                   */                          
	.word     EE_CORTEX_MX_DMA1_STREAM0_ISR       /* DMA1 Stream 0                */
	.word     EE_CORTEX_MX_DMA1_STREAM1_ISR       /* DMA1 Stream 1                */
	.word     EE_CORTEX_MX_DMA1_STREAM2_ISR       /* DMA1 Stream 2                */
	.word     EE_CORTEX_MX_DMA1_STREAM3_ISR       /* DMA1 Stream 3                */
	.word     EE_CORTEX_MX_DMA1_STREAM4_ISR       /* DMA1 Stream 4                */
	.word     EE_CORTEX_MX_DMA1_STREAM5_ISR       /* DMA1 Stream 5                */
	.word     EE_CORTEX_MX_DMA1_STREAM6_ISR       /* DMA1 Stream 6                */
	.word     EE_CORTEX_MX_ADC_ISR                /* ADC1, ADC2 and ADC3s         */                   
	.word     EE_CORTEX_MX_CAN1_TX_ISR            /* CAN1 TX                      */                         
	.word     EE_CORTEX_MX_CAN1_RX0_ISR           /* CAN1 RX0                     */                          
	.word     EE_CORTEX_MX_CAN1_RX1_ISR           /* CAN1 RX1                     */                          
	.word     EE_CORTEX_MX_CAN1_SCE_ISR           /* CAN1 SCE                     */                          
	.word     EE_CORTEX_MX_EXTI9_5_ISR            /* External Line[9:5]s          */                          
	.word     EE_CORTEX_MX_TIM1_BRK_TIM9_ISR      /* TIM1 Break and TIM9          */         
	.word     EE_CORTEX_MX_TIM1_UP_TIM10_ISR      /* TIM1 Update and TIM10        */         
	.word     EE_CORTEX_MX_TIM1_TRG_COM_TIM11_ISR /* TIM1 Trigger and Commutation and TIM11 */
	.word     EE_CORTEX_MX_TIM1_CC_ISR            /* TIM1 Capture Compare         */                          
	.word     EE_CORTEX_MX_TIM2_ISR               /* TIM2                         */                   
	.word     EE_CORTEX_MX_TIM3_ISR               /* TIM3                         */                   
	.word     EE_CORTEX_MX_TIM4_ISR               /* TIM4                         */                   
	.word     EE_CORTEX_MX_I2C1_EV_ISR            /* I2C1 Event                   */                          
	.word     EE_CORTEX_MX_I2C1_ER_ISR            /* I2C1 Error                   */                          
	.word     EE_CORTEX_MX_I2C2_EV_ISR            /* I2C2 Event                   */                          
	.word     EE_CORTEX_MX_I2C2_ER_ISR            /* I2C2 Error                   */                            
	.word     EE_CORTEX_MX_SPI1_ISR               /* SPI1                         */                   
	.word     EE_CORTEX_MX_SPI2_ISR               /* SPI2                         */                   
	.word     EE_CORTEX_MX_USART1_ISR             /* USART1                       */                   
	.word     EE_CORTEX_MX_USART2_ISR             /* USART2                       */                   
	.word     EE_CORTEX_MX_USART3_ISR             /* USART3                       */                   
	.word     EE_CORTEX_MX_EXTI15_10_ISR          /* External Line[15:10]s        */                          
	.word     EE_CORTEX_MX_RTC_Alarm_ISR          /* RTC Alarm (A and B) through EXTI Line */                 
	.word     EE_CORTEX_MX_OTG_FS_WKUP_ISR        /* USB OTG FS Wakeup through EXTI line */                       
	.word     EE_CORTEX_MX_TIM8_BRK_TIM12_ISR     /* TIM8 Break and TIM12         */         
	.word     EE_CORTEX_MX_TIM8_UP_TIM13_ISR      /* TIM8 Update and TIM13        */         
	.word     EE_CORTEX_MX_TIM8_TRG_COM_TIM14_ISR /* TIM8 Trigger and Commutation and TIM14 */
	.word     EE_CORTEX_MX_TIM8_CC_ISR            /* TIM8 Capture Compare         */                          
	.word     EE_CORTEX_MX_DMA1_Stream7_ISR       /* DMA1 Stream7                 */                          
	.word     EE_CORTEX_MX_FSMC_ISR               /* FSMC                         */                   
	.word     EE_CORTEX_MX_SDIO_ISR               /* SDIO                         */                   
	.word     EE_CORTEX_MX_TIM5_ISR               /* TIM5                         */                   
	.word     EE_CORTEX_MX_SPI3_ISR               /* SPI3                         */                   
	.word     EE_CORTEX_MX_UART4_ISR              /* UART4                        */                   
	.word     EE_CORTEX_MX_UART5_ISR              /* UART5                        */                   
	.word     EE_CORTEX_MX_TIM6_DAC_ISR           /* TIM6 and DAC1&2 underrun errors */                   
	.word     EE_CORTEX_MX_TIM7_ISR               /* TIM7                         */
	.word     EE_CORTEX_MX_DMA2_STREAM0_ISR       /* DMA2 Stream 0                */
	.word     EE_CORTEX_MX_DMA2_STREAM1_ISR       /* DMA2 Stream 1                */
	.word     EE_CORTEX_MX_DMA2_STREAM2_ISR       /* DMA2 Stream 2                */
	.word     EE_CORTEX_MX_DMA2_STREAM3_ISR       /* DMA2 Stream 3                */
	.word     EE_CORTEX_MX_DMA2_STREAM4_ISR       /* DMA2 Stream 4                */
	.word     EE_CORTEX_MX_ETH_ISR                /* Ethernet                     */                   
	.word     EE_CORTEX_MX_ETH_WKUP_ISR           /* Ethernet Wakeup through EXTI line */                     
	.word     EE_CORTEX_MX_CAN2_TX_ISR            /* CAN2 TX                      */                          
	.word     EE_CORTEX_MX_CAN2_RX0_ISR           /* CAN2 RX0                     */                          
	.word     EE_CORTEX_MX_CAN2_RX1_ISR           /* CAN2 RX1                     */                          
	.word     EE_CORTEX_MX_CAN2_SCE_ISR           /* CAN2 SCE                     */                          
	.word     EE_CORTEX_MX_OTG_FS_ISR             /* USB OTG FS                   */                   
	.word     EE_CORTEX_MX_DMA2_STREAM5_ISR       /* DMA2 Stream 5                */
	.word     EE_CORTEX_MX_DMA2_STREAM6_ISR       /* DMA2 Stream 6                */
	.word     EE_CORTEX_MX_DMA2_STREAM7_ISR       /* DMA2 Stream 7                */
	.word     EE_CORTEX_MX_USART6_ISR             /* USART6                       */                    
	.word     EE_CORTEX_MX_I2C3_EV_ISR            /* I2C3 event                   */                          
	.word     EE_CORTEX_MX_I2C3_ER_ISR            /* I2C3 error                   */                          
	.word     EE_CORTEX_MX_OTG_HS_EP1_OUT_ISR     /* USB OTG HS End Point 1 Out   */                   
	.word     EE_CORTEX_MX_OTG_HS_EP1_IN_ISR      /* USB OTG HS End Point 1 In    */                   
	.word     EE_CORTEX_MX_OTG_HS_WKUP_ISR        /* USB OTG HS Wakeup through EXTI */                         
	.word     EE_CORTEX_MX_OTG_HS_ISR             /* USB OTG HS                   */                   
	.word     EE_CORTEX_MX_DCMI_ISR               /* DCMI                         */                   
	.word     EE_CORTEX_MX_CRYP_ISR               /* CRYP crypto                  */                   
	.word     EE_CORTEX_MX_HASH_RNG_ISR           /* Hash and Rng                 */
	.word     EE_CORTEX_MX_FPU_ISR                /* FPU                          */

	.size  __isr_vector, .-__isr_vector							 
							 
