abraham120/erika2/pkg/mcu/st_stm32_stm32f4xx/src/startup_stm32f4xx_gnu.S
/*******************************************************************************
*
* Provide weak aliases for each Exception handler to the EE_cortex_mx_default_ISR. 
* As they are weak aliases, any function with the same name will override 
* this definition.
* 
*******************************************************************************/


   .weak      EE_CORTEX_MX_NMI_ISR
   .thumb_set EE_CORTEX_MX_NMI_ISR,EE_cortex_mx_default_ISR
  
   .weak      EE_CORTEX_MX_HARD_FAULT_ISR
#ifdef	__AUTOSAR_R4_0__  
   .thumb_set EE_CORTEX_MX_HARD_FAULT_ISR,EE_cortex_mx_as_hard_fault_ISR
#else
   .thumb_set EE_CORTEX_MX_HARD_FAULT_ISR,EE_cortex_mx_default_ISR
#endif /*__AUTOSAR_R4_0__*/
  
   .weak      EE_CORTEX_MX_MPU_FAULT_ISR
   .thumb_set EE_CORTEX_MX_MPU_FAULT_ISR,EE_cortex_mx_default_ISR
  
   .weak      EE_CORTEX_MX_BUS_FAULT_ISR
#ifdef	__AUTOSAR_R4_0__  
   .thumb_set EE_CORTEX_MX_BUS_FAULT_ISR,EE_cortex_mx_as_bus_fault_ISR
#else
   .thumb_set EE_CORTEX_MX_BUS_FAULT_ISR,EE_cortex_mx_default_ISR
#endif /*__AUTOSAR_R4_0__*/
   
   .weak      EE_CORTEX_MX_USAGE_FAULT_ISR
   .thumb_set EE_CORTEX_MX_USAGE_FAULT_ISR,EE_cortex_mx_default_ISR

   .weak      EE_cortex_mx_svc_ISR
   .thumb_set EE_cortex_mx_svc_ISR,EE_cortex_mx_default_ISR

   .weak      EE_CORTEX_MX_DEBUG_MONITOR_ISR
   .thumb_set EE_CORTEX_MX_DEBUG_MONITOR_ISR,EE_cortex_mx_default_ISR

   .weak      EE_cortex_mx_pendsv_ISR
   .thumb_set EE_cortex_mx_pendsv_ISR,EE_cortex_mx_default_ISR

   .weak      EE_CORTEX_MX_SYSTICK_ISR
   .thumb_set EE_CORTEX_MX_SYSTICK_ISR,EE_cortex_mx_default_ISR              
  
   .weak      EE_CORTEX_MX_WWDG_ISR                   
   .thumb_set EE_CORTEX_MX_WWDG_ISR,EE_cortex_mx_default_ISR      
                  
   .weak      EE_CORTEX_MX_PVD_ISR      
   .thumb_set EE_CORTEX_MX_PVD_ISR,EE_cortex_mx_default_ISR
               
   .weak      EE_CORTEX_MX_TAMP_STAMP_ISR            
   .thumb_set EE_CORTEX_MX_TAMP_STAMP_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_RTC_WKUP_ISR                  
   .thumb_set EE_CORTEX_MX_RTC_WKUP_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_FLASH_ISR         
   .thumb_set EE_CORTEX_MX_FLASH_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_RCC_ISR      
   .thumb_set EE_CORTEX_MX_RCC_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_EXTI0_ISR         
   .thumb_set EE_CORTEX_MX_EXTI0_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_EXTI1_ISR         
   .thumb_set EE_CORTEX_MX_EXTI1_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_EXTI2_ISR         
   .thumb_set EE_CORTEX_MX_EXTI2_ISR,EE_cortex_mx_default_ISR 
                 
   .weak      EE_CORTEX_MX_EXTI3_ISR         
   .thumb_set EE_CORTEX_MX_EXTI3_ISR,EE_cortex_mx_default_ISR
                        
   .weak      EE_CORTEX_MX_EXTI4_ISR         
   .thumb_set EE_CORTEX_MX_EXTI4_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_DMA1_STREAM0_ISR
   .thumb_set EE_CORTEX_MX_DMA1_STREAM0_ISR,EE_cortex_mx_default_ISR
         
   .weak      EE_CORTEX_MX_DMA1_STREAM1_ISR
   .thumb_set EE_CORTEX_MX_DMA1_STREAM1_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_DMA1_STREAM2_ISR
   .thumb_set EE_CORTEX_MX_DMA1_STREAM2_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_DMA1_STREAM3_ISR
   .thumb_set EE_CORTEX_MX_DMA1_STREAM3_ISR,EE_cortex_mx_default_ISR
                 
   .weak      EE_CORTEX_MX_DMA1_STREAM4_ISR
   .thumb_set EE_CORTEX_MX_DMA1_STREAM4_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_DMA1_STREAM5_ISR
   .thumb_set EE_CORTEX_MX_DMA1_STREAM5_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_DMA1_STREAM6_ISR
   .thumb_set EE_CORTEX_MX_DMA1_STREAM6_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_ADC_ISR      
   .thumb_set EE_CORTEX_MX_ADC_ISR,EE_cortex_mx_default_ISR
               
   .weak      EE_CORTEX_MX_CAN1_TX_ISR   
   .thumb_set EE_CORTEX_MX_CAN1_TX_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_CAN1_RX0_ISR                  
   .thumb_set EE_CORTEX_MX_CAN1_RX0_ISR,EE_cortex_mx_default_ISR
                           
   .weak      EE_CORTEX_MX_CAN1_RX1_ISR                  
   .thumb_set EE_CORTEX_MX_CAN1_RX1_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_CAN1_SCE_ISR                  
   .thumb_set EE_CORTEX_MX_CAN1_SCE_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_EXTI9_5_ISR   
   .thumb_set EE_CORTEX_MX_EXTI9_5_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_TIM1_BRK_TIM9_ISR            
   .thumb_set EE_CORTEX_MX_TIM1_BRK_TIM9_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_TIM1_UP_TIM10_ISR            
   .thumb_set EE_CORTEX_MX_TIM1_UP_TIM10_ISR,EE_cortex_mx_default_ISR
      
   .weak      EE_CORTEX_MX_TIM1_TRG_COM_TIM11_ISR      
   .thumb_set EE_CORTEX_MX_TIM1_TRG_COM_TIM11_ISR,EE_cortex_mx_default_ISR
      
   .weak      EE_CORTEX_MX_TIM1_CC_ISR   
   .thumb_set EE_CORTEX_MX_TIM1_CC_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_TIM2_ISR            
   .thumb_set EE_CORTEX_MX_TIM2_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_TIM3_ISR            
   .thumb_set EE_CORTEX_MX_TIM3_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_TIM4_ISR            
   .thumb_set EE_CORTEX_MX_TIM4_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_I2C1_EV_ISR   
   .thumb_set EE_CORTEX_MX_I2C1_EV_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_I2C1_ER_ISR   
   .thumb_set EE_CORTEX_MX_I2C1_ER_ISR,EE_cortex_mx_default_ISR
                     
