abraham120/erika2/pkg/mcu/st_stm32_stm32f4xx/src/startup_stm32f4xx_gnu.S
   .weak      EE_CORTEX_MX_I2C2_EV_ISR   
   .thumb_set EE_CORTEX_MX_I2C2_EV_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_I2C2_ER_ISR   
   .thumb_set EE_CORTEX_MX_I2C2_ER_ISR,EE_cortex_mx_default_ISR
                           
   .weak      EE_CORTEX_MX_SPI1_ISR            
   .thumb_set EE_CORTEX_MX_SPI1_ISR,EE_cortex_mx_default_ISR
                        
   .weak      EE_CORTEX_MX_SPI2_ISR            
   .thumb_set EE_CORTEX_MX_SPI2_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_USART1_ISR      
   .thumb_set EE_CORTEX_MX_USART1_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_USART2_ISR      
   .thumb_set EE_CORTEX_MX_USART2_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_USART3_ISR      
   .thumb_set EE_CORTEX_MX_USART3_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_EXTI15_10_ISR               
   .thumb_set EE_CORTEX_MX_EXTI15_10_ISR,EE_cortex_mx_default_ISR
               
   .weak      EE_CORTEX_MX_RTC_Alarm_ISR               
   .thumb_set EE_CORTEX_MX_RTC_Alarm_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_OTG_FS_WKUP_ISR         
   .thumb_set EE_CORTEX_MX_OTG_FS_WKUP_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_TIM8_BRK_TIM12_ISR         
   .thumb_set EE_CORTEX_MX_TIM8_BRK_TIM12_ISR,EE_cortex_mx_default_ISR
         
   .weak      EE_CORTEX_MX_TIM8_UP_TIM13_ISR            
   .thumb_set EE_CORTEX_MX_TIM8_UP_TIM13_ISR,EE_cortex_mx_default_ISR
         
   .weak      EE_CORTEX_MX_TIM8_TRG_COM_TIM14_ISR      
   .thumb_set EE_CORTEX_MX_TIM8_TRG_COM_TIM14_ISR,EE_cortex_mx_default_ISR
      
   .weak      EE_CORTEX_MX_TIM8_CC_ISR   
   .thumb_set EE_CORTEX_MX_TIM8_CC_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_DMA1_Stream7_ISR               
   .thumb_set EE_CORTEX_MX_DMA1_Stream7_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_FSMC_ISR            
   .thumb_set EE_CORTEX_MX_FSMC_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_SDIO_ISR            
   .thumb_set EE_CORTEX_MX_SDIO_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_TIM5_ISR            
   .thumb_set EE_CORTEX_MX_TIM5_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_SPI3_ISR            
   .thumb_set EE_CORTEX_MX_SPI3_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_UART4_ISR         
   .thumb_set EE_CORTEX_MX_UART4_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_UART5_ISR         
   .thumb_set EE_CORTEX_MX_UART5_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_TIM6_DAC_ISR                  
   .thumb_set EE_CORTEX_MX_TIM6_DAC_ISR,EE_cortex_mx_default_ISR
               
   .weak      EE_CORTEX_MX_TIM7_ISR            
   .thumb_set EE_CORTEX_MX_TIM7_ISR,EE_cortex_mx_default_ISR
         
   .weak      EE_CORTEX_MX_DMA2_STREAM0_ISR
   .thumb_set EE_CORTEX_MX_DMA2_STREAM0_ISR,EE_cortex_mx_default_ISR
               
   .weak      EE_CORTEX_MX_DMA2_STREAM1_ISR
   .thumb_set EE_CORTEX_MX_DMA2_STREAM1_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_DMA2_STREAM2_ISR
   .thumb_set EE_CORTEX_MX_DMA2_STREAM2_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_DMA2_STREAM3_ISR
   .thumb_set EE_CORTEX_MX_DMA2_STREAM3_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_DMA2_STREAM4_ISR
   .thumb_set EE_CORTEX_MX_DMA2_STREAM4_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_ETH_ISR      
   .thumb_set EE_CORTEX_MX_ETH_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_ETH_WKUP_ISR                  
   .thumb_set EE_CORTEX_MX_ETH_WKUP_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_CAN2_TX_ISR   
   .thumb_set EE_CORTEX_MX_CAN2_TX_ISR,EE_cortex_mx_default_ISR
                           
   .weak      EE_CORTEX_MX_CAN2_RX0_ISR                  
   .thumb_set EE_CORTEX_MX_CAN2_RX0_ISR,EE_cortex_mx_default_ISR
                           
   .weak      EE_CORTEX_MX_CAN2_RX1_ISR                  
   .thumb_set EE_CORTEX_MX_CAN2_RX1_ISR,EE_cortex_mx_default_ISR
                           
   .weak      EE_CORTEX_MX_CAN2_SCE_ISR                  
   .thumb_set EE_CORTEX_MX_CAN2_SCE_ISR,EE_cortex_mx_default_ISR
                           
   .weak      EE_CORTEX_MX_OTG_FS_ISR      
   .thumb_set EE_CORTEX_MX_OTG_FS_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_DMA2_STREAM5_ISR
   .thumb_set EE_CORTEX_MX_DMA2_STREAM5_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_DMA2_STREAM6_ISR
   .thumb_set EE_CORTEX_MX_DMA2_STREAM6_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_DMA2_STREAM7_ISR
   .thumb_set EE_CORTEX_MX_DMA2_STREAM7_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_USART6_ISR      
   .thumb_set EE_CORTEX_MX_USART6_ISR,EE_cortex_mx_default_ISR
                        
   .weak      EE_CORTEX_MX_I2C3_EV_ISR   
   .thumb_set EE_CORTEX_MX_I2C3_EV_ISR,EE_cortex_mx_default_ISR
                        
   .weak      EE_CORTEX_MX_I2C3_ER_ISR   
   .thumb_set EE_CORTEX_MX_I2C3_ER_ISR,EE_cortex_mx_default_ISR
                        
   .weak      EE_CORTEX_MX_OTG_HS_EP1_OUT_ISR         
   .thumb_set EE_CORTEX_MX_OTG_HS_EP1_OUT_ISR,EE_cortex_mx_default_ISR
               
   .weak      EE_CORTEX_MX_OTG_HS_EP1_IN_ISR            
   .thumb_set EE_CORTEX_MX_OTG_HS_EP1_IN_ISR,EE_cortex_mx_default_ISR
               
   .weak      EE_CORTEX_MX_OTG_HS_WKUP_ISR         
   .thumb_set EE_CORTEX_MX_OTG_HS_WKUP_ISR,EE_cortex_mx_default_ISR
            
   .weak      EE_CORTEX_MX_OTG_HS_ISR      
   .thumb_set EE_CORTEX_MX_OTG_HS_ISR,EE_cortex_mx_default_ISR
                  
   .weak      EE_CORTEX_MX_DCMI_ISR            
   .thumb_set EE_CORTEX_MX_DCMI_ISR,EE_cortex_mx_default_ISR
                     
   .weak      EE_CORTEX_MX_CRYP_ISR            
   .thumb_set EE_CORTEX_MX_CRYP_ISR,EE_cortex_mx_default_ISR
               
   .weak      EE_CORTEX_MX_HASH_RNG_ISR                  
   .thumb_set EE_CORTEX_MX_HASH_RNG_ISR,EE_cortex_mx_default_ISR   

   .weak      EE_CORTEX_MX_FPU_ISR                  
   .thumb_set EE_CORTEX_MX_FPU_ISR,EE_cortex_mx_default_ISR  
   
